export const linesLocation = [
  {
    locations: [
      { lat: -6.78733, lng: -42.992241 }, // Fim da rota
      { lat: -6.787416, lng: -42.992167 }, //
      { lat: -6.787513, lng: -42.992149 }, //
      { lat: -6.78764, lng: -42.992219 }, //
      { lat: -6.787658, lng: -42.992307 }, //
      { lat: -6.787357, lng: -42.992785 }, //
      { lat: -6.787027, lng: -42.993179 }, //
      { lat: -6.786826, lng: -42.993354 }, //
      { lat: -6.786682, lng: -42.993461 }, // Terminal Rodoviario
      { lat: -6.783535, lng: -42.998232 }, //
      { lat: -6.782593, lng: -42.999757 }, //
      { lat: -6.781243, lng: -43.001722 }, //
      { lat: -6.780123, lng: -43.003108 }, //
      { lat: -6.778961, lng: -43.004335 }, //
      { lat: -6.776035, lng: -43.00742 }, //
      { lat: -6.775633, lng: -43.007673 }, //
      { lat: -6.773766, lng: -43.009674 }, //
      { lat: -6.773185, lng: -43.010328 }, //
      { lat: -6.772918, lng: -43.010676 }, // Curva Bucar Neto
      { lat: -6.772669, lng: -43.011177 }, // Curva Bucar Neto
      { lat: -6.772464, lng: -43.011474 }, // Curva Bucar Neto
      { lat: -6.7724, lng: -43.011509 }, // Curva Bucar Neto
      { lat: -6.771817, lng: -43.011879 }, // Curva Bucar Neto
      { lat: -6.771336, lng: -43.012223 }, // Curva Bucar Neto
      { lat: -6.771223, lng: -43.012314 }, // Curva Bucar Neto
      { lat: -6.771071, lng: -43.012516 }, // Curva Bucar Neto
      { lat: -6.770499, lng: -43.01362 }, // Correção
      { lat: -6.769326, lng: -43.016099 }, // Correção
      { lat: -6.768865, lng: -43.017006 }, // Curva - Mercado Central
      { lat: -6.768525, lng: -43.017502 }, // Mercado Central
      { lat: -6.768682, lng: -43.018962 }, // Correção
      { lat: -6.768925, lng: -43.022691 }, // Correção - Detona Coxinha
      { lat: -6.769088, lng: -43.02412 }, // Euripedes Aguiar
      { lat: -6.769111, lng: -43.024485 }, // Correção
      { lat: -6.769797, lng: -43.034901 }, // Garagem da prefeitura
      { lat: -6.769801, lng: -43.035093 }, // Av. Gov. Dirceu Arco Verde
      { lat: -6.769897, lng: -43.035104 }, //
      { lat: -6.773266, lng: -43.034727 }, //
      { lat: -6.774706, lng: -43.034578 }, //
      { lat: -6.775303, lng: -43.034409 }, //
      { lat: -6.775766, lng: -43.034199 }, //
      { lat: -6.776354, lng: -43.033808 }, // Av. Gov. Dirceu Arco Verde
      { lat: -6.77692, lng: -43.033186 }, // Rotatória Trevo I
      { lat: -6.776931, lng: -43.03311 }, // Rotatória Trevo I
      { lat: -6.776975, lng: -43.033061 }, // Rotatória Trevo I
      { lat: -6.777037, lng: -43.033046 }, // Rotatória Trevo I
    ],
  },
  {
    locations: [
      { lat: -6.774037, lng: -43.009452 }, //
      { lat: -6.773949, lng: -43.009492 }, //
      { lat: -6.773766, lng: -43.009674 }, //
      { lat: -6.773185, lng: -43.010328 }, //
      { lat: -6.772918, lng: -43.010676 }, // Curva Bucar Neto
      { lat: -6.772669, lng: -43.011177 }, // Curva Bucar Neto
      { lat: -6.772464, lng: -43.011474 }, // Curva Bucar Neto
      { lat: -6.7724, lng: -43.011509 }, // Curva Bucar Neto
      { lat: -6.771817, lng: -43.011879 }, // Curva Bucar Neto
      { lat: -6.771336, lng: -43.012223 }, // Curva Bucar Neto
      { lat: -6.771223, lng: -43.012314 }, // Curva Bucar Neto
      { lat: -6.771071, lng: -43.012516 }, // Curva Bucar Neto
      { lat: -6.770499, lng: -43.01362 }, // Correção
      { lat: -6.769326, lng: -43.016099 }, // Correção
      { lat: -6.768865, lng: -43.017006 }, // Curva - Mercado Central
      { lat: -6.768525, lng: -43.017502 }, // Mercado Central
      { lat: -6.768682, lng: -43.018962 }, // Correção
      { lat: -6.768925, lng: -43.022691 }, // Correção - Detona Coxinha
      { lat: -6.769088, lng: -43.02412 }, // Euripedes Aguiar
      { lat: -6.769111, lng: -43.024485 }, // Correção
      { lat: -6.769797, lng: -43.034901 }, // Garagem da prefeitura
      { lat: -6.769801, lng: -43.035093 }, // Av. Gov. Dirceu Arco Verde
      { lat: -6.769897, lng: -43.035104 }, //
      { lat: -6.773266, lng: -43.034727 }, //
      { lat: -6.774706, lng: -43.034578 }, //
      { lat: -6.775303, lng: -43.034409 }, //
      { lat: -6.775766, lng: -43.034199 }, //
      { lat: -6.776354, lng: -43.033808 }, // Av. Gov. Dirceu Arco Verde
      { lat: -6.77692, lng: -43.033186 }, // Rotatória Trevo I
      { lat: -6.776931, lng: -43.03311 }, // Rotatória Trevo I
      { lat: -6.776975, lng: -43.033061 }, // Rotatória Trevo I
      { lat: -6.777037, lng: -43.033046 }, // Rotatória Trevo I
      { lat: -6.777108, lng: -43.033086 }, // Rotatória Trevo I
      { lat: -6.777123, lng: -43.033165 }, // Rotatória Trevo I
      { lat: -6.777268, lng: -43.033234 }, // Rotatória Trevo I
      { lat: -6.777737, lng: -43.033511 }, // BR343
      { lat: -6.778644, lng: -43.034583 }, //
      { lat: -6.780254, lng: -43.036431 }, //
      { lat: -6.782003, lng: -43.038477 }, //
      { lat: -6.784334, lng: -43.041123 }, //
      { lat: -6.784985, lng: -43.041802 }, //
      { lat: -6.786093, lng: -43.042773 }, // UFPI - Portão
      { lat: -6.787119, lng: -43.041498 }, // UFPI - Fim da rota
    ],
  },
  {
    locations: [
      { lat: -6.763259, lng: -43.010237 }, // Inícioo
      { lat: -6.761276, lng: -43.01093 }, // Ponte Pi - Ma
      { lat: -6.757292, lng: -43.012412 }, // BR230
      { lat: -6.756615, lng: -43.012765 }, //
      { lat: -6.756237, lng: -43.013039 }, //
      { lat: -6.755843, lng: -43.013424 }, //
      { lat: -6.755392, lng: -43.01402 }, //
      { lat: -6.755089, lng: -43.014636 }, //
      { lat: -6.754873, lng: -43.01538 }, //
      { lat: -6.754817, lng: -43.015951 }, //
      { lat: -6.754871, lng: -43.016824 }, //
      { lat: -6.755027, lng: -43.018185 }, //
      { lat: -6.755202, lng: -43.019675 }, //
      { lat: -6.755366, lng: -43.021486 }, //
      { lat: -6.755384, lng: -43.022179 }, //
      { lat: -6.755315, lng: -43.022745 }, //
      { lat: -6.755147, lng: -43.023332 }, //
      { lat: -6.754814, lng: -43.02437 }, //
      { lat: -6.754198, lng: -43.026248 }, //
      { lat: -6.754251, lng: -43.026395 }, //
      { lat: -6.754345, lng: -43.026411 }, //
      { lat: -6.754418, lng: -43.026351 }, //
      { lat: -6.754405, lng: -43.026269 }, //
      { lat: -6.754354, lng: -43.026221 }, //
      { lat: -6.754256, lng: -43.026231 }, //
      { lat: -6.754202, lng: -43.026223 }, // BR230
      { lat: -6.754256, lng: -43.026231 }, //
      { lat: -6.754354, lng: -43.026221 }, //
      { lat: -6.754405, lng: -43.026269 }, //
      { lat: -6.754418, lng: -43.026351 }, //
      { lat: -6.754345, lng: -43.026411 }, //
      { lat: -6.754251, lng: -43.026395 }, //
      { lat: -6.754198, lng: -43.026248 }, //
      { lat: -6.754814, lng: -43.02437 }, //
      { lat: -6.755147, lng: -43.023332 }, //
      { lat: -6.755315, lng: -43.022745 }, //
      { lat: -6.755384, lng: -43.022179 }, //
      { lat: -6.755366, lng: -43.021486 }, //
      { lat: -6.755202, lng: -43.019675 }, //
      { lat: -6.755027, lng: -43.018185 }, //
      { lat: -6.754871, lng: -43.016824 }, //
      { lat: -6.754817, lng: -43.015951 }, //
      { lat: -6.754873, lng: -43.01538 }, //
      { lat: -6.755089, lng: -43.014636 }, //
      { lat: -6.755392, lng: -43.01402 }, //
      { lat: -6.755843, lng: -43.013424 }, //
      { lat: -6.756237, lng: -43.013039 }, //
      { lat: -6.756615, lng: -43.012765 }, //
      { lat: -6.757292, lng: -43.012412 }, // BR230
      { lat: -6.761276, lng: -43.01093 }, // Ponte Pi - Ma
      { lat: -6.76384, lng: -43.010056 }, // BR230
      { lat: -6.766963, lng: -43.008926 }, // BR230
      { lat: -6.772377, lng: -43.006953 }, // Curva BR343 - BR230
      { lat: -6.772636, lng: -43.007185 }, // Curva BR343 - BR230
      { lat: -6.772861, lng: -43.007413 }, // Curva BR343 - BR230
      { lat: -6.77317, lng: -43.00755 }, // Curva BR343
      { lat: -6.773507, lng: -43.007526 }, //
      { lat: -6.773839, lng: -43.007454 }, //
      { lat: -6.774049, lng: -43.007445 }, //
      { lat: -6.774301, lng: -43.007492 }, //
      { lat: -6.774601, lng: -43.007611 }, // Curva BR343
      { lat: -6.775199, lng: -43.0081 }, // Semáforo
      { lat: -6.784567, lng: -43.015596 }, //
      { lat: -6.784569, lng: -43.015687 }, //
      { lat: -6.782619, lng: -43.02035 }, //
      { lat: -6.777226, lng: -43.032699 }, //
      { lat: -6.777008, lng: -43.033038 }, //
      { lat: -6.776975, lng: -43.033061 }, // Rotatória Trevo I
    ],
  },
]
